const _申请类型 = ["空置房", "123"] as const;

// 警告 这里仅为了演示 实际上的业务类型为 string
export type 申请类型 = (typeof _申请类型)[number];

// 警告 这里仅为了演示 实际上的业务类型应该都来自于 api 目录内
export interface 优惠申请表单_VO {
	房屋: string;
	申请类型: "空置房";
	费用项目: "费用项目";
	申请人: "张三";
	申请电话: "13712345678";
	开始时间: "2025-05-01";
	结束时间: "2025-05-31";
	申请名说明: string;
	图片材料: "";
}

/** 默认表单 @description 对外导出用于其他场景使用 */
export const defaultForm: 优惠申请表单_VO = {
	房屋: "楼栋-单元-房屋",
	申请类型: "空置房",
	费用项目: "费用项目",
	申请人: "张三",
	申请电话: "13712345678",
	开始时间: "2025-05-01",
	结束时间: "2025-05-31",
	申请名说明: "",
	图片材料: "",
};

/**
 * 优惠申请表单 props
 * @description
 * 为了避免全局类型冲突 故设计较长的类型名称
 */
export interface DiscountApplyFormProps {
	/** 表单数据 */
	form: 优惠申请表单_VO;
	/** 表单组件重置时默认使用的对象 */
	defaultValues: 优惠申请表单_VO;
}
