const _费用类型 = [
	"物业费",
	"押金",
	"停车费",
	"煤气费",
	"取暖费",
	"维修费",
	"服务费",
	"其他",
	"水费",
	"电费",
	"租金",
	"公摊费",
] as const;

// 警告 这里仅为了演示 实际上的业务类型为 string
export type 费用类型 = (typeof _费用类型)[number];

// 警告 这里仅为了演示 实际上的业务类型应该都来自于 api 目录内
export interface 场地预约订单_VO {
	费用类型: 费用类型;
	收费项目: string;
	费用标识: "周期性费用" | "一次性费用";
	付费类型: "预付费" | "后付费";
	/**
	 * 费用类型为 押金 时，该表单隐藏
	 */
	"缴费周期(单位:月)"?: string;
	/**
	 * 费用类型为 煤气费 时，该表单隐藏
	 */
	"预付期(单位:天)"?: string;
	单位: string;
	账户抵扣: "是" | "否";
	手机缴费: "是" | "否";
	进位方式: "四舍五入" | "向上取整" | "向下取整";
	保留小数位: "取整" | "1位" | "2位" | "3位" | "4位";
	状态: string;
	计算公式: string;
	计费单价: string;
	固定费用: string | `${number}` | number;
}

/** 默认表单 @description 对外导出用于其他场景使用 */
export const defaultForm: 场地预约订单_VO = {
	费用类型: "物业费",
	收费项目: "",
	费用标识: "周期性费用",
	付费类型: "预付费",
	"缴费周期(单位:月)": "1",
	"预付期(单位:天)": "30",
	单位: "元/平方米·月",
	账户抵扣: "是",
	手机缴费: "是",
	进位方式: "四舍五入",
	保留小数位: "2位",
	状态: "启用",
	计算公式: "",
	计费单价: "",
	固定费用: "",
};

/**
 * 费用项设置表单 props
 * @description
 * 为了避免全局类型冲突 故设计较长的类型名称
 */
export interface ReserveVenueOrderFormProps {
	/** 表单数据 */
	form: 场地预约订单_VO;
	/** 表单组件重置时默认使用的对象 */
	defaultValues: 场地预约订单_VO;
}
