export interface 管理小区_列表数据 {
	小区ID: string;
	小区名称: string;
	附近地标: string;
	城市编码: string;
	状态: string;
}

export interface 管理小区_列表查询_VO {
	小区编号?: string;
	小区名称?: string;
}

export const tableData: 管理小区_列表数据[] = [
	{
		小区ID: "2025061266671408",
		小区名称: "Test68-1",
		附近地标: "孵化园",
		城市编码: "北京市海淀区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671409",
		小区名称: "阳光花园",
		附近地标: "外滩",
		城市编码: "上海市黄浦区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671410",
		小区名称: "翠湖居",
		附近地标: "西湖",
		城市编码: "浙江省杭州市西湖区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671411",
		小区名称: "锦江国际",
		附近地标: "珠江新城",
		城市编码: "广东省广州市天河区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671412",
		小区名称: "天府新区",
		附近地标: "科学城",
		城市编码: "四川省成都市天府新区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671413",
		小区名称: "金沙国际",
		附近地标: "夫子庙",
		城市编码: "江苏省南京市秦淮区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671414",
		小区名称: "华润万象城",
		附近地标: "解放碑",
		城市编码: "重庆市渝中区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671415",
		小区名称: "保利中心",
		附近地标: "东湖",
		城市编码: "湖北省武汉市武昌区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671416",
		小区名称: "龙湖天街",
		附近地标: "钟楼",
		城市编码: "陕西省西安市碑林区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671417",
		小区名称: "万科城市花园",
		附近地标: "五四广场",
		城市编码: "山东省青岛市市南区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671418",
		小区名称: "恒大御景湾",
		附近地标: "星海广场",
		城市编码: "辽宁省大连市中山区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671419",
		小区名称: "碧桂园天玺",
		附近地标: "鼓浪屿",
		城市编码: "福建省厦门市思明区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671420",
		小区名称: "融创观澜府",
		附近地标: "滇池",
		城市编码: "云南省昆明市西山区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671421",
		小区名称: "绿地中心",
		附近地标: "大明湖",
		城市编码: "山东省济南市历下区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671422",
		小区名称: "中海国际社区",
		附近地标: "玄武湖",
		城市编码: "江苏省南京市玄武区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671423",
		小区名称: "华润二十四城",
		附近地标: "橘子洲",
		城市编码: "湖南省长沙市岳麓区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671424",
		小区名称: "保利和光屿湖",
		附近地标: "大雁塔",
		城市编码: "陕西省西安市雁塔区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671425",
		小区名称: "龙湖西宸原著",
		附近地标: "西湖",
		城市编码: "浙江省杭州市上城区",
		状态: "审核未通过",
	},
	{
		小区ID: "2025061266671426",
		小区名称: "万科金域华府",
		附近地标: "海河",
		城市编码: "天津市和平区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671427",
		小区名称: "恒大华府",
		附近地标: "松花江",
		城市编码: "黑龙江省哈尔滨市道里区",
		状态: "审核通过",
	},
	{
		小区ID: "2025061266671428",
		小区名称: "碧桂园天玺湾",
		附近地标: "白塔",
		城市编码: "山西省太原市迎泽区",
		状态: "审核未通过",
	},
];
