/** 楼栋单元选择表单数据 */
export interface 楼栋单元选择表单_VO {
	楼栋编号: string;
	单元编号: string;
}

/** 楼栋单元搜索条件 */
export interface 楼栋单元搜索_VO {
	楼栋编号?: string;
	单元编号?: string;
}

/** 默认表单 @description 对外导出用于其他场景使用 */
export const defaultForm: 楼栋单元选择表单_VO = {
	楼栋编号: "",
	单元编号: "",
};

/**
 * 楼栋单元选择表单 props
 * @description
 * 为了避免全局类型冲突 故设计较长的类型名称
 */
export interface UnitAuthFormProps {
	/** 表单数据 */
	form: 楼栋单元选择表单_VO;
	/** 表单组件重置时默认使用的对象 */
	defaultValues: 楼栋单元选择表单_VO;
}

/** 楼栋单元选择列表数据 */
export interface 楼栋单元选择列表_VO {
	楼栋编号: string;
	单元编号: string;
}

/** 楼栋单元选择弹框的搜索栏配置 */
export const 楼栋单元选择弹框搜索数据: 楼栋单元选择列表_VO[] = [
	{ 楼栋编号: "8", 单元编号: "0" },
	{ 楼栋编号: "CBZMQ", 单元编号: "0" },
	{ 楼栋编号: "CBZMQ", 单元编号: "1" },
	{ 楼栋编号: "11111111", 单元编号: "1" },
	{ 楼栋编号: "B1", 单元编号: "1" },
	{ 楼栋编号: "测试0611", 单元编号: "0" },
	{ 楼栋编号: "999999", 单元编号: "1" },
	{ 楼栋编号: "33", 单元编号: "0" },
	{ 楼栋编号: "3", 单元编号: "2" },
	{ 楼栋编号: "3", 单元编号: "1" },
	{ 楼栋编号: "A1", 单元编号: "1" },
	{ 楼栋编号: "A1", 单元编号: "2" },
	{ 楼栋编号: "A2", 单元编号: "1" },
	{ 楼栋编号: "A2", 单元编号: "2" },
	{ 楼栋编号: "A3", 单元编号: "1" },
	{ 楼栋编号: "A3", 单元编号: "2" },
	{ 楼栋编号: "B2", 单元编号: "1" },
	{ 楼栋编号: "B2", 单元编号: "2" },
	{ 楼栋编号: "B3", 单元编号: "1" },
	{ 楼栋编号: "B3", 单元编号: "2" },
	{ 楼栋编号: "C1", 单元编号: "1" },
	{ 楼栋编号: "C1", 单元编号: "2" },
	{ 楼栋编号: "C2", 单元编号: "1" },
	{ 楼栋编号: "C2", 单元编号: "2" },
	{ 楼栋编号: "C3", 单元编号: "1" },
	{ 楼栋编号: "C3", 单元编号: "2" },
	{ 楼栋编号: "D1", 单元编号: "1" },
	{ 楼栋编号: "D1", 单元编号: "2" },
	{ 楼栋编号: "D2", 单元编号: "1" },
	{ 楼栋编号: "D2", 单元编号: "2" },
	{ 楼栋编号: "E1", 单元编号: "1" },
	{ 楼栋编号: "E1", 单元编号: "2" },
	{ 楼栋编号: "E2", 单元编号: "1" },
	{ 楼栋编号: "E2", 单元编号: "2" },
	{ 楼栋编号: "F1", 单元编号: "1" },
];
